drxnch/device-stm32/Firmware/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "fatfs.h"
#include "stm32l4xx_hal_gpio.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "ssd1306.h"
#include "ssd1306_tests.h"
#include "ssd1306_fonts.h"
#include "display.h"

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef struct {
  void (*draw)(void);
  uint8_t input;
  uint8_t parent_id;  
} display;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
#define HOME_STATE 0
#define MUSIC_STATE 1
#define TIMER_STATE 2
#define ALARM_STATE 3
#define TIMER_PRESET_STATE 4
#define SET_TIMER_STATE 5
#define MUSIC_PLAYLIST_STATE 6
#define MUSIC_ALBUM_STATE 7
#define MUSIC_ALLSONGS_STATE 8
#define ALARM_PRESET_STATE 9
#define ALARM_SET_STATE 10



#define DOWN_PRESSED (HAL_GPIO_ReadPin(TEMP_DOWN_GPIO_Port, TEMP_DOWN_Pin) == GPIO_PIN_SET)
#define UP_PRESSED   (HAL_GPIO_ReadPin(TEMP_UP_GPIO_Port, TEMP_UP_Pin) == GPIO_PIN_SET)
#define BUTTON_PRESSED 1

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c1;

UART_HandleTypeDef hlpuart1;

SAI_HandleTypeDef hsai_BlockA1;
DMA_HandleTypeDef hdma_sai1_a;

SD_HandleTypeDef hsd1;
DMA_HandleTypeDef hdma_sdmmc1_rx;
DMA_HandleTypeDef hdma_sdmmc1_tx;

TIM_HandleTypeDef htim1;

/* USER CODE BEGIN PV */
/*
  _____  _____  _______      __       _______ ______   __      __     _____  _____          ____  _      ______  _____ 
 |  __ \|  __ \|_   _\ \    / /   /\ |__   __|  ____|  \ \    / /\   |  __ \|_   _|   /\   |  _ \| |    |  ____|/ ____|
 | |__) | |__) | | |  \ \  / /   /  \   | |  | |__      \ \  / /  \  | |__) | | |    /  \  | |_) | |    | |__  | (___   
 |  ___/|  _  /  | |   \ \/ /   / /\ \  | |  |  __|      \ \/ / /\ \ |  _  /  | |   / /\ \ |  _ <| |    |  __|  \___ \  
 | |    | | \ \ _| |_   \  /   / ____ \ | |  | |____      \  / ____ \| | \ \ _| |_ / ____ \| |_) | |____| |____ ____) | 
 |_|    |_|  \_\_____|   \/   /_/    \_\|_|  |______|      \/_/    \_\_|  \_\_____/_/    \_\____/|______|______|_____/ 
                                                     
                                                                  
*/

//Initialisation Code
uint8_t rtc_time=0;
uint8_t battery_percentage = 0;
char song_name[18]; //Change if font size changes
char artist[18]; // Change if font size changes
char test_song[9]="music.wav";
uint8_t current_state = HOME_STATE;
uint8_t next_state = 0;
bool down_button_last = false;


// SDMMC
FATFS MyFatFS; 
FIL MyFile;    
FRESULT res;   
uint32_t byteswritten;

// Audio
#define AUDIO_BUF_SIZE 4096 
#define READBUF_SIZE 4096
uint16_t audio_buffer[AUDIO_BUF_SIZE]; // The main buffer
uint8_t playing = 0;                   // State flag
UINT bytes_read;                       // To track SD card progress
uint8_t readBuf[READBUF_SIZE]; // Buffer for encoded MP3 data
int16_t outBuf[2 * 1152];      // Buffer for decoded PCM data
uint32_t adc_buffer[1];
uint8_t timer_ready = 0;
uint8_t last_button_state = 0; 

// Display

// Miscellaneous (Buttons, Sensors, States etc.)


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_LPUART1_UART_Init(void);
static void MX_TIM1_Init(void);
static void MX_I2C1_Init(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_SAI1_Init(void);
static void MX_ADC1_Init(void);
void MX_USB_HOST_Process(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/*
  _____  _____  _______      __       _______ ______   _    _  _____ ______ _____     _____  ____  _____  ______  
 |  __ \|  __ \|_   _\ \    / /   /\ |__   __|  ____| | |  | |/ ____|  ____|  __ \   / ____|/ __ \|  __ \|  ____| 
 | |__) | |__) | | |  \ \  / /   /  \   | |  | |__    | |  | | (___ | |__  | |__) | | |    | |  | | |  | | |__   
 |  ___/|  _  /  | |   \ \/ /   / /\ \  | |  |  __|   | |  | |\___ \|  __| |  _  /  | |    | |  | | |  | |  __|  
 | |    | | \ \ _| |_   \  /   / ____ \ | |  | |____  | |__| |____) | |____| | \ \  | |____| |__| | |__| | |____ 
 |_|    |_|  \_\_____|   \/   /_/    \_\|_|  |______|  \____/|_____/|______|_|  \_\  \_____|\____/|_____/|______|
                                                                                   
                              
*/

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){
  timer_ready = 1;
	HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_7);

}

void PlaySong(char song[9]) {
    res = f_mount(&MyFatFS, (TCHAR const *)SDPath, 1);
  if (res == FR_OK) {
    // 2. Open the audio file
    res = f_open(&MyFile, song, FA_READ);
    if (res == FR_OK) {
      // 3. Skip WAV header (44 bytes)
      f_lseek(&MyFile, 44);
      // 4. Initial Buffer Fill (Read bytes, but fill half the samples)
      // We read AUDIO_BUF_SIZE * 2 because each sample is 2 bytes (uint16_t)
      res = f_read(&MyFile, audio_buffer, AUDIO_BUF_SIZE * 2, &bytes_read);
      if (res == FR_OK && bytes_read > 0) {
        // 5. Start SAI DMA (SAI expects number of samples, not bytes)
        HAL_SAI_Transmit_DMA(&hsai_BlockA1, (uint8_t *)audio_buffer,
                             AUDIO_BUF_SIZE);
        playing = 1;
      }
    } else {
      // Show error if file not found
      char errBuf[20];
      sprintf(errBuf, "Open Error: %d", res);
      ssd1306_SetCursor(2, 30);
      ssd1306_WriteString(errBuf, Font_7x10, White);
      ssd1306_UpdateScreen();
    }
  }
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

